## tibble

Tiblle은 data.frame을 현대적으로 재구성하는 것으로 <br>
훨씬 대용량 데이터를 다루는데 훨씬 효율적이다. char 데이터 유형을 factor가 아닌 char로 인식하기 때문에<br>
문자형을 다루는데 좋다.

In [5]:
library(tidyverse) # tibble 을 가지고 있다.

Warning message:
"package 'tidyverse' was built under R version 3.6.3"-- Attaching packages --------------------------------------- tidyverse 1.3.0 --
√ ggplot2 3.3.3     √ purrr   0.3.4
√ tibble  3.1.0     √ dplyr   1.0.5
√ tidyr   1.1.3     √ stringr 1.4.0
√ readr   1.3.1     √ forcats 0.4.0
Warning message:
"package 'ggplot2' was built under R version 3.6.3"Warning message:
"package 'tibble' was built under R version 3.6.3"Warning message:
"package 'tidyr' was built under R version 3.6.3"Warning message:
"package 'purrr' was built under R version 3.6.3"Warning message:
"package 'dplyr' was built under R version 3.6.3"-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

In [3]:
getwd()

[1] "C:/Users/uskaw/R프로그래밍 실습"

In [4]:
class(as_tibble(iris)) # as_tibble은 원래 data.frame 을 tibble 형태의 데이터로 만든다.
class(iris)

[1] "tbl_df"     "tbl"        "data.frame"

[1] "data.frame"

In [9]:
#tibble 데이터 프레임 생성
# R은 20년된 언어이기 때문에 느리다.
tibble(
    x = 1:5,
    y = 1, # 빈테이블도 하나의 숫자로 채워준다.
    z = x ^ 2 + y
)

  x y z
1 1 1  2
2 2 1  5
3 3 1 10
4 4 1 17
5 5 1 26

In [12]:
tribble(
    ~x, ~y, ~z,
    #--|--|-----
    "a" , 2, 3.6,
    "b", 1, 8.5
)

  x y z
1 a 2 3.6
2 b 1 8.5

In [26]:
df <- tibble(
    x = runif(5), # 0 ~ 1 까지의 균일분포
    y = rnorm(5) # 정규분포
)

In [27]:
df %>% show()

# A tibble: 5 x 2
      x      y
  <dbl>  <dbl>
1 0.216 -0.760
2 0.728 -0.539
3 0.287 -1.38
4 0.860  2.10
5 0.843  0.909

In [28]:
df # google colab or jupyer notebook을 사용하는 경우 %>% show() 붙여줘야
# 요약된 정보가 추출됨

  x         y
1 0.2157344 -0.7599899
2 0.7277673 -0.5392367
3 0.2868609 -1.3780455
4 0.8603059  2.1041156
5 0.8433742  0.9091995

In [29]:
df$x %>% show() # 출력

[1] 0.2157344 0.7277673 0.2868609 0.8603059 0.8433742

In [30]:
df$x # extract by name, return vector

[1] 0.2157344 0.7277673 0.2868609 0.8603059 0.8433742

In [31]:
df[["x"]] # extract by name, return vector

[1] 0.2157344 0.7277673 0.2868609 0.8603059 0.8433742

In [38]:
df[[1]] # Extract by position, return vector

[1] 0.2157344 0.7277673 0.2868609 0.8603059 0.8433742

In [39]:
df["x"] # Extract by column, return tibble

  x
1 0.2157344
2 0.7277673
3 0.2868609
4 0.8603059
5 0.8433742

In [36]:
df[1] # Extract by column, return tibble

  x
1 0.2157344
2 0.7277673
3 0.2868609
4 0.8603059
5 0.8433742

In [37]:
df %>% . $x

[1] 0.2157344 0.7277673 0.2868609 0.8603059 0.8433742

### dpyler 
#### - dplyr - select , filter, groupby, summarize , %>%
dplyr 패키지는 c++로 작성되어 빠르고 가볍다. <br>

In [6]:
df <- read.table(file = "Pre_Season_Batter.csv", sep=",", header=T) %>% as_tibble()

# df<- as_tibble(df) 를  %>% 으로 가ㅏㄴ소화

In [7]:
show(df)

# A tibble: 1,393 x 29
   batter_id batter_name  year team  avg       G    AB     R     H   X2B   X3B
       <int> <fct>       <int> <fct> <fct> <int> <int> <int> <int> <int> <int>
 1         0 가르시아     2018 LG    0.35      7    20     1     7     1     0
 2         1 강경학       2011 한화  0         4     2     2     0     0     0
 3         1 강경학       2014 한화  -         4     0     2     0     0     0
 4         1 강경학       2015 한화  0.13     10    23     3     3     0     0
 5         1 강경학       2016 한화  0.188    14    32     4     6     1     1
 6         1 강경학       2017 한화  0.222    11    36    10     8     0     0
 7         2 강구성       2013 NC    0         3     4     0     0     0     0
 8         2 강구성       2016 NC    0         3     1     0     0     0     0
 9         2 강구성       2017 NC    1         2     1     0     1     0     0
10        69 김태완       2006 한화  0.2      10    15     0     3     0     0
# ... with 1,383 more rows, and 18 more variables: HR <int>, TB <int>,
#   RBI <int>, SB <int>, CS <int>, BB <int>, HBP <int>, SO <int>, GDP <int>,
#   SLG <dbl>, OBP <dbl>, E <int>, height.weight <fct>, year_born <fct>,
#   position <fct>, career <fct>, starting_salary <fct>, OPS <dbl>

In [8]:
#base R
df[, c("batter_name", "team")] %>% show()

# A tibble: 1,393 x 2
   batter_name team
   <fct>       <fct>
 1 가르시아    LG
 2 강경학      한화
 3 강경학      한화
 4 강경학      한화
 5 강경학      한화
 6 강경학      한화
 7 강구성      NC
 8 강구성      NC
 9 강구성      NC
10 김태완      한화
# ... with 1,383 more rows

In [9]:
#dolyr
df %>% select(., batter_name, team) %>% show()

# A tibble: 1,393 x 2
   batter_name team
   <fct>       <fct>
 1 가르시아    LG
 2 강경학      한화
 3 강경학      한화
 4 강경학      한화
 5 강경학      한화
 6 강경학      한화
 7 강구성      NC
 8 강구성      NC
 9 강구성      NC
10 김태완      한화
# ... with 1,383 more rows

In [12]:
df %>% select(., -batter_name, -team) %>% show()

# A tibble: 1,393 x 27
   batter_id  year avg       G    AB     R     H   X2B   X3B    HR    TB   RBI
       <int> <int> <fct> <int> <int> <int> <int> <int> <int> <int> <int> <int>
 1         0  2018 0.35      7    20     1     7     1     0     1    11     5
 2         1  2011 0         4     2     2     0     0     0     0     0     1
 3         1  2014 -         4     0     2     0     0     0     0     0     0
 4         1  2015 0.13     10    23     3     3     0     0     0     3     1
 5         1  2016 0.188    14    32     4     6     1     1     0     9     2
 6         1  2017 0.222    11    36    10     8     0     0     2    14     4
 7         2  2013 0         3     4     0     0     0     0     0     0     0
 8         2  2016 0         3     1     0     0     0     0     0     0     0
 9         2  2017 1         2     1     0     1     0     0     0     1     0
10        69  2006 0.2      10    15     0     3     0     0     0     3     3
# ... with 1,383 more rows, and 15 more variables: SB <int>, CS <int>,
#   BB <int>, HBP <int>, SO <int>, GDP <int>, SLG <dbl>, OBP <dbl>, E <int>,
#   height.weight <fct>, year_born <fct>, position <fct>, career <fct>,
#   starting_salary <fct>, OPS <dbl>

In [13]:
df %>% select(., 이름 = batter_name, 팀 = team) %>% show()

# A tibble: 1,393 x 2
   이름     팀
   <fct>    <fct>
 1 가르시아 LG
 2 강경학   한화
 3 강경학   한화
 4 강경학   한화
 5 강경학   한화
 6 강경학   한화
 7 강구성   NC
 8 강구성   NC
 9 강구성   NC
10 김태완   한화
# ... with 1,383 more rows

In [14]:
df %>% select(., batter_name1 = batter_name, batter_name2 = batter_name, batter_name3= batter_name) %>% show()

# A tibble: 1,393 x 3
   batter_name1 batter_name2 batter_name3
   <fct>        <fct>        <fct>
 1 가르시아     가르시아     가르시아
 2 강경학       강경학       강경학
 3 강경학       강경학       강경학
 4 강경학       강경학       강경학
 5 강경학       강경학       강경학
 6 강경학       강경학       강경학
 7 강구성       강구성       강구성
 8 강구성       강구성       강구성
 9 강구성       강구성       강구성
10 김태완       김태완       김태완
# ... with 1,383 more rows

In [33]:
df %>% select(., 이름 = batter_name,팀 = team, 'R/G' = R/G) %>% show()

# A tibble: 1,393 x 3
   이름     팀    `R/G`
   <fct>    <fct> <int>
 1 가르시아 LG        1
 2 강경학   한화      2
 3 강경학   한화      2
 4 강경학   한화      3
 5 강경학   한화      4
 6 강경학   한화     10
 7 강구성   NC        0
 8 강구성   NC        0
 9 강구성   NC        0
10 김태완   한화      0
# ... with 1,383 more rows

In [30]:
show(select(df, 이름 = batter_name,팀 = team, 'R/G' = R/G))

# A tibble: 1,393 x 3
   이름     팀    `R/G`
   <fct>    <fct> <int>
 1 가르시아 LG        1
 2 강경학   한화      2
 3 강경학   한화      2
 4 강경학   한화      3
 5 강경학   한화      4
 6 강경학   한화     10
 7 강구성   NC        0
 8 강구성   NC        0
 9 강구성   NC        0
10 김태완   한화      0
# ... with 1,383 more rows

In [34]:
# %>% 의 마지막 단계가 지정된 변수에 저장된다.
df %>% show()

# A tibble: 1,393 x 29
   batter_id batter_name  year team  avg       G    AB     R     H   X2B   X3B
       <int> <fct>       <int> <fct> <fct> <int> <int> <int> <int> <int> <int>
 1         0 가르시아     2018 LG    0.35      7    20     1     7     1     0
 2         1 강경학       2011 한화  0         4     2     2     0     0     0
 3         1 강경학       2014 한화  -         4     0     2     0     0     0
 4         1 강경학       2015 한화  0.13     10    23     3     3     0     0
 5         1 강경학       2016 한화  0.188    14    32     4     6     1     1
 6         1 강경학       2017 한화  0.222    11    36    10     8     0     0
 7         2 강구성       2013 NC    0         3     4     0     0     0     0
 8         2 강구성       2016 NC    0         3     1     0     0     0     0
 9         2 강구성       2017 NC    1         2     1     0     1     0     0
10        69 김태완       2006 한화  0.2      10    15     0     3     0     0
# ... with 1,383 more rows, and 18 more variables: HR <int>, TB <int>,
#   RBI <int>, SB <int>, CS <int>, BB <int>, HBP <int>, SO <int>, GDP <int>,
#   SLG <dbl>, OBP <dbl>, E <int>, height.weight <fct>, year_born <fct>,
#   position <fct>, career <fct>, starting_salary <fct>, OPS <dbl>

In [35]:
df_2 <- df %>% select(., 이름 = batter_name,팀 = team, 'R/G' = R/G) %>% show()

# A tibble: 1,393 x 3
   이름     팀    `R/G`
   <fct>    <fct> <int>
 1 가르시아 LG        1
 2 강경학   한화      2
 3 강경학   한화      2
 4 강경학   한화      3
 5 강경학   한화      4
 6 강경학   한화     10
 7 강구성   NC        0
 8 강구성   NC        0
 9 강구성   NC        0
10 김태완   한화      0
# ... with 1,383 more rows

In [36]:
show(df_2)

NULL

#### filter : 어떤 행의 값을 추출한다. 

base R

In [39]:
df[df$team == "한화", c("team", "batter_name")] %>% show()

# A tibble: 131 x 2
   team  batter_name
   <fct> <fct>
 1 한화  강경학
 2 한화  강경학
 3 한화  강경학
 4 한화  강경학
 5 한화  강경학
 6 한화  김태완
 7 한화  김태완
 8 한화  김태완
 9 한화  김태완
10 한화  김태완
# ... with 121 more rows

In [40]:
df[df$team == "한화" & (df$G >= 5 | df$AB >= 15), c("team", "batter_name" , "G", "AB")] %>% show()

# A tibble: 104 x 4
   team  batter_name     G    AB
   <fct> <fct>       <int> <int>
 1 한화  강경학         10    23
 2 한화  강경학         14    32
 3 한화  강경학         11    36
 4 한화  김태완         10    15
 5 한화  김태완          8    22
 6 한화  김태완         10    24
 7 한화  김태완         10    25
 8 한화  김태완          9    28
 9 한화  김태완         10    16
10 한화  강상원          6     0
# ... with 94 more rows

#### dplyr 방식 : filter 함수

In [42]:
df %>% filter(., team == "한화" & (G >= 5 | AB >= 15)) %>% show()

# A tibble: 104 x 29
   batter_id batter_name  year team  avg       G    AB     R     H   X2B   X3B
       <int> <fct>       <int> <fct> <fct> <int> <int> <int> <int> <int> <int>
 1         1 강경학       2015 한화  0.13     10    23     3     3     0     0
 2         1 강경학       2016 한화  0.188    14    32     4     6     1     1
 3         1 강경학       2017 한화  0.222    11    36    10     8     0     0
 4        69 김태완       2006 한화  0.2      10    15     0     3     0     0
 5        69 김태완       2007 한화  0.318     8    22     4     7     3     0
 6        69 김태완       2008 한화  0.375    10    24     3     9     1     0
 7        69 김태완       2009 한화  0.32     10    25     5     8     3     0
 8        69 김태완       2013 한화  0.25      9    28     3     7     0     0
 9        69 김태완       2014 한화  0.125    10    16     1     2     0     0
10         8 강상원       2016 한화  -         6     0     1     0     0     0
# ... with 94 more rows, and 18 more variables: HR <int>, TB <int>, RBI <int>,
#   SB <int>, CS <int>, BB <int>, HBP <int>, SO <int>, GDP <int>, SLG <dbl>,
#   OBP <dbl>, E <int>, height.weight <fct>, year_born <fct>, position <fct>,
#   career <fct>, starting_salary <fct>, OPS <dbl>

In [45]:
df %>% filter(., team == "한화" & (G >= 5 | AB >= 15)) %>% select(., team, batter_name, G, AB) %>% show()

# A tibble: 104 x 4
   team  batter_name     G    AB
   <fct> <fct>       <int> <int>
 1 한화  강경학         10    23
 2 한화  강경학         14    32
 3 한화  강경학         11    36
 4 한화  김태완         10    15
 5 한화  김태완          8    22
 6 한화  김태완         10    24
 7 한화  김태완         10    25
 8 한화  김태완          9    28
 9 한화  김태완         10    16
10 한화  강상원          6     0
# ... with 94 more rows

#### groupby , summarise
groupby : split by key <br>
summarize : APPLY(sum), Combine

In [50]:
df %>% group_by(team) %>% show()

# A tibble: 1,393 x 29
# Groups:   team [13]
   batter_id batter_name  year team  avg       G    AB     R     H   X2B   X3B
       <int> <fct>       <int> <fct> <fct> <int> <int> <int> <int> <int> <int>
 1         0 가르시아     2018 LG    0.35      7    20     1     7     1     0
 2         1 강경학       2011 한화  0         4     2     2     0     0     0
 3         1 강경학       2014 한화  -         4     0     2     0     0     0
 4         1 강경학       2015 한화  0.13     10    23     3     3     0     0
 5         1 강경학       2016 한화  0.188    14    32     4     6     1     1
 6         1 강경학       2017 한화  0.222    11    36    10     8     0     0
 7         2 강구성       2013 NC    0         3     4     0     0     0     0
 8         2 강구성       2016 NC    0         3     1     0     0     0     0
 9         2 강구성       2017 NC    1         2     1     0     1     0     0
10        69 김태완       2006 한화  0.2      10    15     0     3     0     0
# ... with 1,383 more rows, and 18 more variables: HR <int>, TB <int>,
#   RBI <int>, SB <int>, CS <int>, BB <int>, HBP <int>, SO <int>, GDP <int>,
#   SLG <dbl>, OBP <dbl>, E <int>, height.weight <fct>, year_born <fct>,
#   position <fct>, career <fct>, starting_salary <fct>, OPS <dbl>

In [57]:
df %>% group_by(team) %>% summarise(., G_AVG = mean(G), AB_A = mean(AB), R_SUM = sum(R)) %>% show()
# 특별하게 계산을 이용해야한다면 summarise를 이용하자

# A tibble: 13 x 4
   team     G_AVG  AB_A R_SUM
   <fct>    <dbl> <dbl> <int>
 1 KIA       7.87  16.8   321
 2 KT        7.63  16.3   143
 3 LG        8.74  20.3   500
 4 NC        8.49  17     195
 5 SK        8.37  19.9   426
 6 넥센      9.10  19.0   315
 7 두산     10.7   22.1   601
 8 롯데      8.21  17.7   424
 9 삼성      8.79  20.1   416
10 우리      7.33  17.3    10
11 한화      7.76  18.2   335
12 현대     10.1   25.3    42
13 히어로즈  8.2   15.6     5

In [60]:
df_3 <-df %>% group_by(team) %>% summarise(., G_AVG = mean(G), AB_A = mean(AB), R_SUM = sum(R))

In [220]:
df_3

   team     G_AVG     AB_A     R_SUM
1  KIA       7.871212 16.84091 321
2  KT        7.631579 16.33333 143
3  LG        8.741379 20.32759 500
4  NC        8.488636 17.00000 195
5  SK        8.372781 19.88166 426
6  넥센      9.098214 19.00893 315
7  두산     10.736559 22.09677 601
8  롯데      8.210843 17.74096 424
9  삼성      8.785235 20.06040 416
10 우리      7.333333 17.33333  10
11 한화      7.755725 18.24427 335
12 현대     10.055556 25.33333  42
13 히어로즈  8.200000 15.60000   5

In [266]:
#과제1
df = read.csv("Pre_Season_Batter.csv",header = T, stringsAsFactors = F)

In [267]:
team2hometown = function(df){
    temp <- c()
    for(team in df[,"team"]){
        switch(team,
            LG = temp <- c(temp , '서울'),
            NC = temp <- c(temp , '창원'),
            롯데 = temp <- c(temp , '부산'),
            KT = temp <- c(temp , '수원'),
             KIA= temp <- c(temp , '광주'),
            히어로즈 = temp <- c(temp , '서울'),
               한화 = temp <- c(temp , '대전'),
                현대= temp <- c(temp , '수원'),
               삼성 = temp <- c(temp , '대구'),
               SK = temp <- c(temp , '인천'),
               넥센 = temp <- c(temp , '서울'),
               두산 = temp <- c(temp , '서울'),
               우리 = temp <- c(temp , '서울'),
               temp <- c(temp, NA)
              )
    }
    return(data.frame(df, hometown = temp))
}

In [268]:
df <- team2hometown(df)
sum(is.na(df$hometown))

[1] 0

In [269]:
str(team2hometown(df))

'data.frame':	1393 obs. of  31 variables:
 $ batter_id      : int  0 1 1 1 1 1 2 2 2 69 ...
 $ batter_name    : chr  "가르시아" "강경학" "강경학" "강경학" ...
 $ year           : int  2018 2011 2014 2015 2016 2017 2013 2016 2017 2006 ...
 $ team           : chr  "LG" "한화" "한화" "한화" ...
 $ avg            : chr  "0.35" "0" "-" "0.13" ...
 $ G              : int  7 4 4 10 14 11 3 3 2 10 ...
 $ AB             : int  20 2 0 23 32 36 4 1 1 15 ...
 $ R              : int  1 2 2 3 4 10 0 0 0 0 ...
 $ H              : int  7 0 0 3 6 8 0 0 1 3 ...
 $ X2B            : int  1 0 0 0 1 0 0 0 0 0 ...
 $ X3B            : int  0 0 0 0 1 0 0 0 0 0 ...
 $ HR             : int  1 0 0 0 0 2 0 0 0 0 ...
 $ TB             : int  11 0 0 3 9 14 0 0 1 3 ...
 $ RBI            : int  5 1 0 1 2 4 0 0 0 3 ...
 $ SB             : int  0 0 0 3 1 0 0 1 0 0 ...
 $ CS             : int  0 1 0 0 2 0 0 0 0 0 ...
 $ BB             : int  2 0 0 4 0 3 0 1 0 1 ...
 $ HBP            : int  0 2 0 1 1 0 0 0 0 1 ...
 $ SO             : int  3 1 0 9 10 10 0 0 0 5 ...
 $ GDP            : int  1 0 0 0 0 0 1 1 0 1 ...
 $ SLG            : num  0.55 0 NA 0.13 0.281 0.389 0 0 1 0.2 ...
 $ OBP            : num  0.409 0.5 NA 0.286 0.212 0.282 0 0.5 1 0.278 ...
 $ E              : int  1 0 0 2 0 1 0 0 0 0 ...
 $ height.weight  : chr  "177cm/93kg" "180cm/72kg" "180cm/72kg" "180cm/72kg" ...
 $ year_born      : chr  "1985년 04월 12일" "1992년 08월 11일" "1992년 08월 11일" "1992년 08월 11일" ...
 $ position       : chr  "내야수(우투우타)" "내야수(우투좌타)" "내야수(우투좌타)" "내야수(우투좌타)" ...
 $ career         : chr  "쿠바 Ciego de Avila Maximo Gomez Baez(대)" "광주대성초-광주동성중-광주동성고" "광주대성초-광주동성중-광주동성고" "광주대성초-광주동성중-광주동성고" ...
 $ starting_salary: chr  "" "10000만원" "10000만원" "10000만원" ...
 $ OPS            : num  0.959 0.5 NA 0.416 0.493 0.671 0 0.5 2 0.478 ...
 $ hometown       : Factor w/ 8 levels "광주","대구",..: 5 3 3 3 3 3 8 8 8 3 ...
 $ hometown.1     : Factor w/ 8 levels "광주","대구",..: 5 3 3 3 3 3 8 8 8 3 ...

In [270]:
unique(df$team)

 [1] "LG"       "한화"     "NC"       "넥센"     "롯데"     "삼성"
 [7] "KT"       "SK"       "KIA"      "두산"     "히어로즈" "우리"
[13] "현대"

In [271]:
head(df[c('team', 'hometown')], 20)

   team hometown
1  LG   서울
2  한화 대전
3  한화 대전
4  한화 대전
5  한화 대전
6  한화 대전
7  NC   창원
8  NC   창원
9  NC   창원
10 한화 대전
11 한화 대전
12 한화 대전
13 한화 대전
14 한화 대전
15 한화 대전
16 한화 대전
17 한화 대전
18 넥센 서울
19 넥센 서울
20 NC   창원